Конфигурация/DataProcessors/ОбменДаннымиСЛККЕСИАФинанс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ОбменДаннымиСЛККЕСИАФинанс</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеСвойства</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пиф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>d7p1:TextDocument</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Конфигурация/InformationRegisters/ФинансовыеПоказатели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ФинансовыеПоказатели</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубъектАналитики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
						<v8:Type>cfg:CatalogRef.СтратегииИндивидуальногоИнвестирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПоказателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыФинансовыхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыЗаявокПайщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыЗаявокПайщиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зачисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Погашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обмен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/ЗачислениеПаев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ЗачислениеПаев</Name>
			<BasedOn>
				<xr:Item>Document.ПереводДенежныхСредств</xr:Item>
				<xr:Item>Document.ЗаявкаПайщика</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ДолиПайщиковВИнвестиционномФонде</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пайщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоступлениеДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПереводДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНадбавки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/DataProcessors/ОбменДаннымиСЛККЕСИАФинанс/Forms/Форма/Ext/Form/Module.bsl
#Область События_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
		Объект.Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ЭтаФорма.ИмяОбъектаЕсиа = ЭтаФорма.Элементы.ИмяОбъектаЕсиа.СписокВыбора[0].Значение;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьВидимостьИДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область События_элементов_формы

&НаКлиенте
Процедура ВыполнитьЗапрос(Команда)
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.Метод) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите метод",, "Метод");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.СтрокаЗапроса) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Введите текст запроса",, "СтрокаЗапроса");
		Возврат;
	КонецЕсли; 
	
	ЭтаФорма.Ответ = "";
	ЭтаФорма.Элементы.ГруппаОтвет.Заголовок = "Ответ"; 
	
	ВыполнитьЗапросНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗапросНаСервере()
	
	ПараметрыПодключения = РеквизитФормыВЗначение("Объект").ПолучитьПараметрыПодключения();
			
	ТекТелоЗапроса = "";
	
	Если ЭтаФорма.ТелоЗапроса.КоличествоСтрок() > 0 Тогда
		ТекТелоЗапроса = ЭтаФорма.ТелоЗапроса.ПолучитьТекст();
	КонецЕсли;
	
	ТекстСообщения = "Не удалось выполнить запрос."; 
		
	HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос(ЭтаФорма.Метод, ПараметрыПодключения, "/api/v1/back_office/" + ЭтаФорма.СтрокаЗапроса, ТекТелоЗапроса, ТекстСообщения);
	
	Если HTTPОтвет = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	Иначе 
		
		ЭтаФорма.Элементы.ГруппаОтвет.Заголовок = Строка(HTTPОтвет.КодСостояния) + ?(HTTPОтвет.КодСостояния = 200, " ОК", "");
		
		ОтветСтрокой = HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8");
	
		Попытка
			ОтветОбъект = ДесериализоватьСтрокуJSON(ОтветСтрокой);
			ОтветСтрокой = ПолучитьСтрокуJSON(ОтветОбъект, Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Windows));
		Исключение
			ОтветСтрокой = "Не удалось десериализовать ответ";	
		КонецПопытки;
								
		МассивСтрок = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(ОтветСтрокой, Символы.ПС);
		
		Для Каждого ТекСтрока Из МассивСтрок Цикл
			ЭтаФорма.Ответ.ДобавитьСтроку(ТекСтрока);	
		КонецЦикла
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИмпортироватьНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ИмпортироватьЗаявкиПайщиков(ЭтаФорма.ВидЗаявок);
	ОбработкаОбъект.ОповеститьОбОшибках();

КонецПроцедуры

&НаКлиенте
Процедура Импортировать(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите дату");
		Возврат;	
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.ВидЗаявок) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите вид импортируемых заявок");
		Возврат;	
	КонецЕсли;
				
	ИмпортироватьНаСервере();
	
КонецПроцедуры 

&НаСервере
Процедура ВыгрузитьСтоимостьПаевНаСервере()
		
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ВыгрузитьСтоимостьПаев(ЭтаФорма.ЦенаПая, ЭтаФорма.СЧА);
	ОбработкаОбъект.ОповеститьОбОшибках();

КонецПроцедуры

&НаСервере
Процедура ВыгрузитьСтоимостьПаевЗаПериодНаСервере()
		
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ФинансовыеПоказатели_ЦеныПаев.Период КАК Период,
		|	ФинансовыеПоказатели_ЦеныПаев.Значение КАК РасчетнаяЦена,
		|	ФинансовыеПоказатели_СЧА.Значение КАК СЧА
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели_ЦеныПаев
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели_СЧА
		|			ПО ФинансовыеПоказатели_ЦеныПаев.Организация = ФинансовыеПоказатели_СЧА.Организация
		|				И ФинансовыеПоказатели_ЦеныПаев.СубъектАналитики = ФинансовыеПоказатели_СЧА.СубъектАналитики
		|				И ФинансовыеПоказатели_ЦеныПаев.Период = ФинансовыеПоказатели_СЧА.Период
		|				И (ФинансовыеПоказатели_СЧА.ВидПоказателя = &ВидПоказателяСЧА)
		|		ПО (ФинансовыеПоказатели_ЦеныПаев.Организация = КлиентыДоверительногоУправленияСрезПоследних.Организация)
		|			И (ФинансовыеПоказатели_ЦеныПаев.СубъектАналитики = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления)
		|ГДЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент = &ПаевойИнвестиционныйФонд
		|	И ФинансовыеПоказатели_ЦеныПаев.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ФинансовыеПоказатели_ЦеныПаев.Организация = &Организация
		|	И ФинансовыеПоказатели_ЦеныПаев.ВидПоказателя = &ВидПоказателяЦенаПая
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период");
	
	Запрос.УстановитьПараметр("ДатаНачала",					ЭтаФорма.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",				ЭтаФорма.Период.ДатаОкончания);	
	Запрос.УстановитьПараметр("ПаевойИнвестиционныйФонд",	Объект.Пиф);
	Запрос.УстановитьПараметр("Организация",				Объект.Организация);
	Запрос.УстановитьПараметр("ВидПоказателяСЧА",			Справочники.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок);
	Запрос.УстановитьПараметр("ВидПоказателяЦенаПая",		Справочники.ВидыФинансовыхПоказателей.СтоимостьПая);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл		
		ОбработкаОбъект.Дата = Выборка.Период;
		ОбработкаОбъект.ВыгрузитьСтоимостьПаев(Выборка.РасчетнаяЦена, Выборка.СЧА);
		ОбработкаОбъект.ОповеститьОбОшибках();
	КонецЦикла;		

КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьСтоимостьПаев(Команда) 
		
	Если Не ЗначениеЗаполнено(Объект.Пиф) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите ПИФ");
		Возврат;	
	КонецЕсли;
	
	Объект.Результат.Очистить();
	
	Если ЭтаФорма.ВыгрузкаЗаПериод Тогда
		
		Если Не ЗначениеЗаполнено(ЭтаФорма.Период) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите период");
			Возврат;	
		КонецЕсли;
			
		ВыгрузитьСтоимостьПаевЗаПериодНаСервере();
		
	Иначе
		Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите дату");
			Возврат;	
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ЭтаФорма.ЦенаПая) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите цену пая");
			Возврат;	
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ЭтаФорма.СЧА) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите сумму СЧА");
			Возврат;	
		КонецЕсли;
				
		ВыгрузитьСтоимостьПаевНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ВыгрузитьОперациюНаСервере()
	
	// Сначала нужно определить идентификатор документа в ЛКК
	// Для зачисления паев по заявке на приобретение это номер ООВП,
	// для других операций это номер заявки
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭтаФорма.ЗачислениеПаев,
					Новый Структура("Заявка, НомерЗаявки, ВидЗаявки",
							"Заявка",
							"Заявка.НомерЗаявки",
							"Заявка.ВидЗаявки"));
						
	Если Реквизиты.ВидЗаявки = Перечисления.ВидыЗаявокПайщиков.Зачисление Тогда
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ			
			|	ПроцессЗачислениеПаев.НомерОтчетаОВозможностиЗачисленияПаев КАК НомерООВП
			|ИЗ
			|	БизнесПроцесс.ЗачислениеПаев КАК ПроцессЗачислениеПаев
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗачислениеПаев КАК ДокументЗачислениеПаев
			|		ПО (ДокументЗачислениеПаев.Ссылка = &ЗачислениеПаев)
			|			И (ДокументЗачислениеПаев.Заявка = ПроцессЗачислениеПаев.ЗаявкаПайщика)
			|			И (ДокументЗачислениеПаев.ПоступлениеДенежныхСредств.СтрокаБанковскойВыписки.НазначениеПлатежа ПОДОБНО ""%"" + ПроцессЗачислениеПаев.НомерОтчетаОВозможностиЗачисленияПаев + ""%"")
			|ГДЕ
			|	ПроцессЗачислениеПаев.НомерОтчетаОВозможностиЗачисленияПаев ЕСТЬ НЕ NULL ");
	
		Запрос.УстановитьПараметр("ЗачислениеПаев", ЭтаФорма.ЗачислениеПаев);
		
		Выборка = Запрос.Выполнить().Выбрать();
						
		Если Выборка.Следующий() Тогда
			ИдентификаторДокумента = Выборка.НомерООВП;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для документа не найден бизнес-процесс с ООВП");
			Возврат;
		КонецЕсли;
		
	ИначеЕсли Реквизиты.ВидЗаявки = Перечисления.ВидыЗаявокПайщиков.Обмен Тогда
		ИдентификаторДокумента = Реквизиты.НомерЗаявки + ?(ТипЗнч(ЭтаФорма.ЗачислениеПаев) = Тип("ДокументСсылка.ЗачислениеПаев"), "_B", "_S");
	Иначе
		ИдентификаторДокумента = Реквизиты.НомерЗаявки;
	КонецЕсли;						
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ВыгрузитьОперацииПоПаям(ЭтаФорма.ЗачислениеПаев, ИдентификаторДокумента);
	ОбработкаОбъект.ОповеститьОбОшибках();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОперацию(Команда) 
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.ЗачислениеПаев) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите документ [Зачисление паев]");
		Возврат;	
	КонецЕсли;

	Объект.Результат.Очистить();
	
	ВыгрузитьОперациюНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СверитьОстаткиПаевНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.СверитьОстаткиПаев();
		
КонецПроцедуры

&НаКлиенте
Процедура СверитьОстаткиПаев(Команда)
	СверитьОстаткиПаевНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьФайлыНаСервере(АдресФайла, ИмяФайла)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ВыгрузитьФайлы(ЭтотОбъект.Заявка, АдресФайла, ИмяФайла);
	ОбработкаОбъект.ОповеститьОбОшибках();
		
КонецПроцедуры 

&НаКлиенте
Процедура ВыгрузитьФайлы(Команда) 
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.Заявка) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите заявку");
		Возврат;	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.ПутьКФайлу) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите файл для загрузки");
		Возврат;	
	КонецЕсли;

	Объект.Результат.Очистить();
		
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ЭтаФорма.ПутьКФайлу), ЭтаФорма.УникальныйИдентификатор);
	ВыгрузитьФайлыНаСервере(АдресВоВременномХранилище, ЭтаФорма.ПутьКФайлу);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСтатусНаСервере(НовыйСтатус)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.УстановитьСтатус(ЭтотОбъект.Заявка, НовыйСтатус);
		
	ОбработкаОбъект.ОповеститьОбОшибках();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатус(Команда)
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.Заявка) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите заявку");
		Возврат;	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.СтатусЗаявки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите заявку");
		Возврат;	
	КонецЕсли;
	
	Объект.Результат.Очистить();
	
	НовыйСтатус = "";
	
	Если ЭтаФорма.СтатусЗаявки = 1 Тогда
		НовыйСтатус = "in_queue";
	ИначеЕсли ЭтаФорма.СтатусЗаявки = 2 Тогда
		НовыйСтатус = "in_process";
	ИначеЕсли ЭтаФорма.СтатусЗаявки = 3 Тогда
		НовыйСтатус = "done";
	ИначеЕсли ЭтаФорма.СтатусЗаявки = 4 Тогда
		НовыйСтатус = "rejected";		
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите статус заявки");
		Возврат;
	КонецЕсли;
	
	УстановитьСтатусНаСервере(НовыйСтатус);
	
КонецПроцедуры

&НаКлиентеНаСервере
Процедура МетодПриИзменении(Элемент)
	НастроитьВидимостьИДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	СформироватьТелоЗапроса();
КонецПроцедуры

&НаКлиенте
Процедура ЦенаПаяПриИзменении(Элемент)
	СформироватьТелоЗапроса();
КонецПроцедуры

&НаКлиенте
Процедура СЧАПриИзменении(Элемент)
	СформироватьТелоЗапроса();
КонецПроцедуры 

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	Если ДиалогВыбора.Выбрать() Тогда
		ЭтаФорма.ПутьКФайлу = ДиалогВыбора.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЭкспортСпискаДляПроверкиНаСервере(ТипСпискаСтр, АдресФайла, ИмяФайла)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЭкспортСпискаДляПроверки(ТипСпискаСтр, АдресФайла, ИмяФайла);
	ОбработкаОбъект.ОповеститьОбОшибках();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭкспортСпискаДляПроверки(Команда) 
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.ПутьКФайлу) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите файл для загрузки");
		Возврат;	
	КонецЕсли;
	
	ТипСпискаСтр = ""; 
	
	Если ЭтаФорма.ТипСписка = 1 Тогда
		ТипСпискаСтр = "possible_terrorists";
	ИначеЕсли ЭтаФорма.ТипСписка = 2 Тогда
		ТипСпискаСтр = "operation_cancels";
	ИначеЕсли ЭтаФорма.ТипСписка = 3 Тогда
		ТипСпискаСтр = "uns";
	ИначеЕсли ЭтаФорма.ТипСписка = 4 Тогда
		ТипСпискаСтр = "frozen_assets";		
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите тип загружаемого списка");
		Возврат;
	КонецЕсли;
	
	Объект.Результат.Очистить();
		
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ЭтаФорма.ПутьКФайлу), ЭтаФорма.УникальныйИдентификатор);
	
	ЭкспортСпискаДляПроверкиНаСервере(ТипСпискаСтр, АдресВоВременномХранилище, ЭтаФорма.ПутьКФайлу);
	
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьВводДенежныхСредствНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ВыгрузитьВводыДенежныхСредств(ЭтаФорма.ВводДенежныхСредств);
	ОбработкаОбъект.ОповеститьОбОшибках();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВводДенежныхСредств(Команда)
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.ВводДенежныхСредств) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите документ [Ввод денежных средств]");
		Возврат;	
	КонецЕсли;

	Объект.Результат.Очистить();
	
	ВыгрузитьВводДенежныхСредствНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ИмпортироватьАнкетыНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ИмпортироватьАнкеты();
	ОбработкаОбъект.ОповеститьОбОшибках();
	
КонецПроцедуры

&НаКлиенте
Процедура ИмпортироватьАнкеты(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите дату");
		Возврат;	
	КонецЕсли; 
	
	Объект.Результат.Очистить();
	
	ИмпортироватьАнкетыНаСервере(); 
	
КонецПроцедуры

&НаСервере
Процедура ИмпортироватьДоговорыНаСервере()
	
	РеквизитФормыВЗначение("Объект").ИмпортироватьДоговорыДоверительногоУправления();
		
КонецПроцедуры

&НаКлиенте
Процедура ИмпортироватьДоговоры(Команда)
	
	ИмпортироватьДоговорыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяСправочникаЕсиаПриИзменении(Элемент)
	
	ЭтаФорма.СтрокаЗапроса = ЭтаФорма.ИмяОбъектаЕсиа; 
	
	Если Не ЭтаФорма.Элементы.ГруппаОбъектыЕсиа.Скрыта() Тогда
		ЭтаФорма.Элементы.ГруппаОбъектыЕсиа.Скрыть();	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЭкспортироватьДоговорыНаСервере()
	
	РеквизитФормыВЗначение("Объект").ЭкспортироватьДанныеДоговоровДоверительногоУправления(ЭтотОбъект.СчетДоверительногоУправления);

КонецПроцедуры

&НаКлиенте
Процедура ЭкспортироватьДоговоры(Команда)
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.СчетДоверительногоУправления) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для экспорта данных договора укажите счет доверительного управления");
		Возврат;
	КонецЕсли;
	
	ЭкспортироватьДоговорыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЭкспортироватьСтратегииНаСервере() 
	
	РеквизитФормыВЗначение("Объект").ЭкспортироватьСправочникСтратегий();

КонецПроцедуры

&НаКлиенте
Процедура ЭкспортироватьСтратегии(Команда)
	
	ЭкспортироватьСтратегииНаСервере(); 
	
КонецПроцедуры

&НаСервере
Процедура ЭкспортироватьПортфелиНаСервере()
	
	РеквизитФормыВЗначение("Объект").ЭкспортироватьПортфели(ЭтотОбъект.СчетДоверительногоУправления);

КонецПроцедуры

&НаКлиенте
Процедура ЭкспортироватьПортфели(Команда)
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.СчетДоверительногоУправления) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для экспорта данных договора укажите счет доверительного управления");
		Возврат;
	КонецЕсли;
	
	ЭкспортироватьПортфелиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьЗаявкуПайщикаНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЭкспортироватьЗаявкуПайщика(ЭтаФорма.Заявка,, Истина);
	ОбработкаОбъект.ОповеститьОбОшибках();	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьЗаявкуПайщика(Команда)
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.Заявка) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите документ [Заявка пайщика]");
		Возврат;	
	КонецЕсли;
	
	ВыгрузитьЗаявкуПайщикаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьАнкетуНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЭкспортироватьАнкетыФизЛиц(РаботаСКоллекциями.ЗначениеВМассив(ЭтаФорма.АнкетаФизЛица),,,, Истина);
	ОбработкаОбъект.ОповеститьОбОшибках();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьАнкету(Команда)
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.АнкетаФизЛица) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите документ [Анкета физ. лица]");
		Возврат;	
	КонецЕсли;
	
	ВыгрузитьАнкетуНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область Служебные_процедуры_и_функции
 	
&НаСервереБезКонтекста
Функция ПолучитьСтрокуJSON(Данные, ПараметрыЗаписи = Неопределено)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	
    Если ПараметрыЗаписи = Неопределено Тогда
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет);
	Иначе
		ПараметрыЗаписиJSON = ПараметрыЗаписи;	
	КонецЕсли;
	
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	ЗаписатьJSON(ЗаписьJSON, Данные);
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON;
	
КонецФункции

&НаСервере
Функция ДесериализоватьСтрокуJSON(СтрокаJSON)
	
	ИменаСвойств = "id,owner_id,fund_to_id,user_id,attachmentable_id,actuality_updated_at,birthday,issue_date,expiration_date,created_at,signed_at,closed_at";
	
	ПараметрыЧтения = Новый Структура();
	ПараметрыЧтения.Вставить("ПрочитатьВСоответствие", Истина);
	ПараметрыЧтения.Вставить("ИмяФункцииВосстановления", "ЕСИА_Финанс_ВосстановлениеЗначенияИзJSON");
	ПараметрыЧтения.Вставить("МодульФункцииВосстановления", РаботаСВнешнимиСистемами);
	ПараметрыЧтения.Вставить("ИменаСвойствДляОбработкиВосстановления", РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИменаСвойств, ","));
	  	
	ДанныеJSON = РаботаСВнешнимиСистемамиКлиентСервер.ПолучитьДанныеJSON(СтрокаJSON, ПараметрыЧтения);
	
	Если ТипЗнч(ДанныеJSON) <> Тип("Соответствие") Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Десериализация данных типа [" + ТипЗнч(ДанныеJSON) + "] не поддерживается!");
		ДанныеJSON = Новый Соответствие;
		
	КонецЕсли;
	
	Возврат ДанныеJSON;
	
КонецФункции 

&НаКлиенте
Процедура НастроитьВидимостьИДоступность()
	
	ЭтаФорма.Элементы.ГруппаТелоЗапроса.Видимость = ЗначениеЗаполнено(Метод) И (Метод <> "GET");
	ЭтаФорма.Элементы.ГруппаПараметрыПая.Видимость = (Метод = "POST");
	
	Если Не ЭтаФорма.Элементы.ГруппаТелоЗапроса.Видимость Тогда
		ЭтаФорма.ТелоЗапроса.Очистить();	
	КонецЕсли; 
	
	ИмяСправочникаЕсиаПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторПаяПриИзменении(Элемент)
	СформироватьТелоЗапроса();
КонецПроцедуры 

&НаКлиенте
Процедура СформироватьТелоЗапроса()
	
	ЭтаФорма.ТелоЗапроса.Очистить();
	
	ЭтаФорма.ТелоЗапроса.ДобавитьСтроку("{""data"": ["); 
	ЭтаФорма.ТелоЗапроса.ДобавитьСтроку("{""fund_code"": """ + ЭтаФорма.ИдентификаторПая + """,");	
	ЭтаФорма.ТелоЗапроса.ДобавитьСтроку("""date"": """ + Формат(Объект.Дата, "ДФ=dd.MM.yyyy") + """,");
	ЭтаФорма.ТелоЗапроса.ДобавитьСтроку("""value"": " + Формат(ЭтаФорма.ЦенаПая, "ЧРД=.; ЧГ=0") + ",");
	ЭтаФорма.ТелоЗапроса.ДобавитьСтроку("""scha_value"": " + Формат(ЭтаФорма.СЧА, "ЧРД=.; ЧГ=0") + "}]}");
	
КонецПроцедуры

#КонецОбласти
